#include <iostream>
#include <fstream>
#include <cstdio>
#include <cmath>
#include <algorithm>



namespace first{
    int day, month, N, T, n, Y, raz, raz1;
    std::string C;
    std::string days[] = {"Первое", "Второе", "Третье", "Четвертое", "Пятое", "Шестое", "Седьмое", "Восьмое", "Девятое", "Десятое", "Одиннадцатое",
              "Двенадцатое", "Тринадцатое", "Четырнадцатое", "Пятнадцатое", "Шестнадцатое", "Семнадцатое", "Восемнадцатое",
              "Девятнадцатое", "Двадцатое", "Двадцать первое", "Двадцать второе", "Двадцать третье", "Двадцать Четвертое",
              "Двадцать пятое", "Двадцать шестое", "Двадцать седьмое", "Двадцать восьмое", "Двадцать девятое", "Тринадцатое",
              "Тридцать первое"};
    std::string months[] = {"января", "февраля", "марта", "апреля", "мая", "июня", "июля", "августа", "сентября", "октября", "ноября", "декабря"};
    
    std::string orientations[] = {"С", "З", "Ю", "В"};
    std::string orientations1[] = {"Север", "Запад", "Юг", "Восток"};
    
    std::string numbers[] = {"Десять", "Одиннадцать", "Двенадцать", "Тринадцать", "Четырнадцать", "Пятнадцать", "Шестнадцать", "Семнадцать", 
                "Восемнадцать", "Девятнадцать", "Двадцать", "Двадцать одно", "Двадцать два", "Двадцать три", "Двадцать четыре", "Двадцать пять", 
                "Двадцать шесть", "Двадцать семь", "Двадцать восемь", "Двадцать девять", "Тридцать", "Тридцать одно", "Тридцать два", "Тридцать три",
                "Тридцать четыре", "Тридцать пять", "Тридцать шесть", "Тридцать семь", "Тридцать восемь", "Тридцать девять", "Сорок"};
                
    std::string hundreds[] = {"Сто", "Двести", "Триста", "Четыреста", "Пятьсот", "Шестьсот", "Семьсот", "Восемьсот", "Девятьсот"};
    std::string decades[] = {"одиннадцать", "двенадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать", "восемнадцать", 
                            "Девятнадцать", "Двадцать", "двадцать один", "двадцать два", "двадцать три", "двадцать четыре", "двадцать пять", "двадцать шесть", 
                            "двадцать семь", "двадцать восемь", "двадцать девять", "тридцать", "тридцать один", "тридцать два", "тридцать три", "тридцать четыре",
                            "тридцать пять", "тридцать шесть", "тридцать семь", "тридцать восемь", "тридцать девять", "сорок", "сорок один", "сорок два", "сорок три", 
                            "сорок четыре", "сорок пять", "сорок шесть", "сорок семь", "сорок восемь", "сорок девять", "пятьдесят", "пятьдесят один", "пятьдесят два",  
                            "пятьдесят три", "пятьдесят четыре", "пятьдесят пять", "пятьдесят шесть", "пятьдесят семь", "пятьдесят восемь", "пятьдесят девять", 
                            "шестьдесят", "шестьдесят один", "шестьдесят два", "шестьдесят три", "шестьдесят четыре", "шестьдесят пять", "шестьдесят шесть", "шестьдесят семь",
                            "шестьдесят восемь", "шестьдесят девять", "семьдесят", "семьдесят один", "семьдесят два", "семьдесят три", "семьдесят четыре",
                            "семьдесят пять", "семьдесят шесть", "семьдесят семь", "семьдесят восемь", "семьдесят девять", "восемьдесят", "восемьдесят один", "восемьдесят два",
                            "восемьдесят три", "восемьдесят четыре", "восемьдесят пять", "восемьдесят шесть", "восемьдесят семь", "восемьдесят восемь", "восемьдесят девять",
                            "девяносто", "девяносто один", "девяносто два", "девяносто три", "девяносто четыре", "девяносто пять", "девяносто шесть", "девяносто семь",
                            "девяносто восемь", "девяносто девять"};
    std::string decades1[] = {"десять", "двадцать", "тридцать", "сорок", "пятьдесят", "шестьдесят", "семьдесят", "восемьдесят", "девяносто"};
    std::string ones[] = {"один", "два", "три", "четыре", "пять", "шесть", "семь", "восемь", "девять"};
    
    std::string An;
    std::string colors[] = {"зелен", "красн", "желт", "бел", "черн"};
    std::string animals[] = {"крысы", "коровы", "тигра", "зайца", "дракона", "змеи", "лошади", "овцы", "обезьяны", "курицы", "собаки", "свиньи"};
}

using namespace first;

int main(){
    
// 1
    std::cout << "Вывод заданной даты (день и месяц) в виде текста" << std::endl;
    std::cout << "Введите день - ";
    std::cin >> day;
    std::cout << "Введите месяц - ";
    std::cin >> month;
    while (true){
        if (day <= 0 || day > 31 || month <= 0 || month > 12){
            std::cout << "Введены невереные значения. Попробуйте заново." << std::endl;
            std::cout << "Вывод заданной даты (день и месяц) в виде текста" << std::endl;
            std::cout << "Введите день - ";
            std::cin >> day;
            std::cout << "Введите месяц - ";
            std::cin >> month;
        }
        else{
            std::cout << "Заданная дата в виде текста: " << days[day - 1] << " " << months[month - 1] << std::endl;
            break;
        }
    }
    
// 2
    std::cout << "Вывод направления робота после полученной команды" << std::endl;
    std::cout << "Введите направление C - ";
    std::cin >> C;
    std::cout << "Введите команду N - ";
    std::cin >> N;
    while (true){
        if (N < -1 || N > 1 || (C != "С" & C != "З" & C != "Ю" & C != "В")){
            std::cout << "Введены неверные значения. Попробуйте заново." << std::endl;
            std::cout << "Введите направление C - ";
            std::cin >> C;
            std::cout << "Введите команду N - ";
            std::cin >> N;
        }
        else{
            if (N == 0){
                if (C == "С") {
                    std::cout << "Направление робота: " << orientations[0] << " - " << orientations1[0]  << std::endl;
                }
                if (C == "З"){
                    std::cout << "Направление робота: " << orientations[1] << " - "  << orientations1[1]  << std::endl;
                }
                if (C == "Ю"){
                    std::cout << "Направление робота: " << orientations[2] << " - "  << orientations1[2]  << std::endl;
                }
                if (C == "В"){
                    std::cout << "Направление робота: " << orientations[3] << " - "  << orientations1[3]  << std::endl;
                }
            }
            if (N == 1){
                if (C == "С") {
                    std::cout << "Направление робота: " << orientations[N] << " - "  << orientations1[N] << std::endl;
                }
                if (C == "З"){
                    std::cout << "Направление робота: " << orientations[N + 1] << " - "  << orientations1[N + 1]  << std::endl;
                }
                if (C == "Ю"){
                    std::cout << "Направление робота: " << orientations[N + 2] << " - "  << orientations1[N + 2]  << std::endl;
                }
                if (C == "В"){
                    std::cout << "Направление робота: " << orientations[N - 1] << " - "  << orientations1[N - 1]  << std::endl;
                }
            }
            if (N == -1){
                if (C == "С") {
                    std::cout << "Направление робота: " << orientations[N + 4] << " - "  << orientations1[N + 4]  << std::endl;
                }
                if (C == "З"){
                    std::cout << "Направление робота: " << orientations[N + 1] << " - "  << orientations1[N + 1]  << std::endl;
                }
                if (C == "Ю"){
                    std::cout << "Направление робота: " << orientations[N + 2] << " - "  << orientations1[N + 2]  << std::endl;
                }
                if (C == "В"){
                    std::cout << "Направление робота: " << orientations[N + 3] << " - "  << orientations1[N + 3]  << std::endl;
                }
            }
            break;
        }
    }

// 3
    std::cout << "Вывод строки-описания указанного количества заданий" << std::endl;
    std::cout << "Введите количество заданий T - ";
    std::cin >> T;
    while (true){
        if (T < 10 || T > 40){
            std::cout << "Введено неверное значение. Попробуйте заново." << std::endl;
            std::cout << "Введите количество заданий T - ";
            std::cin >> T;
        }
        else{
            if (T == 21 || T == 31){
                std::cout << "Строка-описание: " << numbers[T - 10] << " учебное задание" << std::endl;
            }
            if (T != 21 & T != 31){
                std::cout << "Строка-описание: " << numbers[T - 10] << " учебных заданий" << std::endl;
            }
            break;
        }
        
    }
    
// 4
    std::cout << "Вывод строки-описания заданного числа в диапазоне 100-999" << std::endl;
    std::cout << "Введите число n - ";
    std::cin >> n;
    while (true){
        if (n < 100 || n > 999){
            std::cout << "Введено неверное значение. Попробуйте заново." << std::endl;
            std::cout << "Введите число n - ";
            std::cin >> n;
        }
        else{
            if (n % 100 == 0){
                std::cout << "Строка-описание: " << hundreds[n / 100 - 1] << std::endl;
            }
            if ((n % 100) / 10 == 0 & n % 10 != 0){
                std::cout << "Строка-описание: " << hundreds[n / 100 - 1] << " " << ones[n % 10 - 1] << std::endl;
            }
            if (n % 10 == 0 & (n % 100) / 10 != 0){
                std::cout << "Строка-описание: " << hundreds[n / 100 - 1] << " " << decades1[(n % 100) / 10 - 1] << std::endl;
            }
            if ((n % 100) / 10 != 0 & n % 10 != 0){
                std::cout << "Строка-описание: " << hundreds[n / 100 - 1] << " " << decades[n % 100 - 11] << std::endl;
            }
            break;
        }

    }
    
// 5
    std::cout << "Определение названия года по его номеру, если 1984 - «год зеленой крысы»" << std::endl;
    std::cout << "Введите номер года Y - ";
    std::cin >> Y;
    while (true){
        if (Y < 0){
            std::cout << "Введено неверное значение. Попробуйте заново." << std::endl;
            std::cout << "Введите номер года Y - ";
            std::cin >> Y;
        }
        else{
            raz = Y % 60;
            raz1 = abs(Y - 1984);
            // if (raz % 3 == 0 & raz % 4 == 0){
            //     if (raz % 60 == 0){
            //         std::cout << "Название года: " << "Год " << colors[0] << "ой " << animals[0] << std::endl;
            //     }
            //     if (raz % 48 == 0){
            //         std::cout << "Название года: " << "Год " << colors[4] << "ой " << animals[0] << std::endl;
            //     }
            //     if (raz % 36 == 0){
            //         std::cout << "Название года: " << "Год " << colors[3] << "ой " << animals[0] << std::endl;
            //     }
            //     if (raz % 24 == 0){
            //         std::cout << "Название года: " << "Год " << colors[2] << "ой " << animals[0] << std::endl;
            //     }
            //     if (raz % 12 == 0){
            //         std::cout << "Название года: " << "Год " << colors[1] << "ой " << animals[0] << std::endl;
            //     }
            // }
            // else{
            //     if (raz % 12 != 0){
            //         if (raz % 12 == 2 || raz % 12 == 3 || raz % 12 == 4){
            //             std::cout << "Название года: " << "Год " << colors[0] << "ого " << animals[raz % 12] << std::endl;
            //         }
            //         else{
            //             std::cout << "Название года: " << "Год " << colors[0] << "ой " << animals[raz % 12] << std::endl;
            //         }
            //     }
            //     if (raz % 12 != 0){
            //         if (raz % 12 == 2 || raz % 12 == 3 || raz % 12 == 4){
            //             std::cout << "Название года: " << "Год " << colors[4] << "ого " << animals[raz % 12] << std::endl;
            //         }
            //         else{
            //             std::cout << "Название года: " << "Год " << colors[4] << "ой " << animals[raz % 12] << std::endl;
            //         }
            //     }
            //     if (raz % 12 != 0){
            //         if (raz % 12 == 2 || raz % 12 == 3 || raz % 12 == 4){
            //             std::cout << "Название года: " << "Год " << colors[3] << "ого " << animals[raz % 12] << std::endl;
            //         }
            //         else{
            //             std::cout << "Название года: " << "Год " << colors[3] << "ой " << animals[raz % 12] << std::endl;
            //         }
            //     }
            //     if (raz % 12 != 0){
            //         if (raz % 12 == 2 || raz % 12 == 3 || raz % 12 == 4){
            //             std::cout << "Название года: " << "Год " << colors[2] << "ого " << animals[raz % 12] << std::endl;
            //         }
            //         else{
            //             std::cout << "Название года: " << "Год " << colors[2] << "ой " << animals[raz % 12] << std::endl;
            //         }
            //     }
            //     if (raz % 12 != 0){
            //         if (raz % 12 == 2 || raz % 12 == 3 || raz % 12 == 4){
            //             std::cout << "Название года: " << "Год " << colors[1] << "ого " << animals[raz % 12] << std::endl;
            //         }
            //         else{
            //             std::cout << "Название года: " << "Год " << colors[1] << "ой " << animals[raz % 12] << std::endl;
            //         }
            //     }
            // }
            if (raz >= 4 & raz <= 15){
                C = "зелен";
            }
            if (raz >= 16 & raz <= 27){
                C = "красн";
            }
            if (raz >= 28 & raz <= 39){
                C = "желт";
            }
            if (raz >= 40 & raz <= 51){
                C = "бел";
            }
            if ((raz >= 52 & raz <= 59) || raz < 4){
                C = "черн";
            }
            
            
            // if (raz1 % 12 == 2){
            //     An = "ого " + animals[2];
            // }
            // if (raz1 % 12 == 3){
            //     An = "ого " + animals[3];
            // }
            // if (raz1 % 12 == 4){
            //     An = "ого " + animals[4];
            // }
            // else{
            //     An = "ой " + animals[raz1 % 12];
            // }
            
            if (raz % 12 == 4){
                An = "ой крысы";
            }
            if (raz % 12 == 5){
                An = "ой коровы";
            }
            if (raz % 12 == 6){
                An = "ого тигра";
            }
            if (raz % 12 == 7){
                An = "ого зайца";
            }
            if (raz % 12 == 8){
                An = "ого дракона";
            }
            if (raz % 12 == 9){
                An = "ой змеи";
            }
            if (raz % 12 == 10){
                An = "ой лошади";
            }
            if (raz % 12 == 11){
                An = "ой овцы";
            }
            if (raz % 12 == 0){
                An = "ой обезьяны";
            }
            if (raz % 12 == 1){
                An = "ой курицы";
            }
            if (raz % 12 == 2){
                An = "ой собаки";
            }
            
            if (raz % 12 == 3){
                An = "ой свиньи";
            }
            std::cout << "Описание года: " << "Год " <<  C << An << std::endl;
            break;
        }
    }
    
}